{
    "historical_sites": [
      {
        "name": "Ephesus Ancient City",
        "description": "Ephesus Ancient City is an important archaeological site and historical place located in the Selcuk district of Izmir province. Established in the 6th century BC, the ancient city gained great significance during the Roman period. It is famous for its notable structures such as the Celsus Library, the Great Theatre, and the Temple of Artemis.",
        "image": "https://example.com/ephesus.jpg",
        "rating": 9.7
      },
      {
        "name": "Pamukkale",
        "description": "Pamukkale is a natural and historical site located in the Denizli province. It is known for its white travertine terraces and the ancient city of Hierapolis. With its thermal waters, ancient pools, and ancient theater, it offers a unique experience to visitors.",
        "image": "https://example.com/pamukkale.jpg",
        "rating": 9.4
      },
      {
        "name": "Cappadocia",
        "description": "Cappadocia is a unique natural and historical region located within the boundaries of Nevsehir, Aksaray, and Kayseri provinces. It is famous for its fairy chimneys, underground cities, and rock-carved churches. Cappadocia, also known for its hot air balloon tours, offers a breathtaking landscape.",
        "image": "https://example.com/cappadocia.jpg",
        "rating": 9.6
      },
      {
        "name": "Troy Ancient City",
        "description": "Troy Ancient City is an archaeological site and historical place located near the Tevfikiye village in Canakkale province. It is known as the place where the Trojan War, described in Homer's Iliad epic, took place. It attracts attention with its ancient ruins and historical significance.",
        "image": "https://example.com/troy.jpg",
        "rating": 9.3
      },
      {
        "name": "Hagia Sophia",
        "description": "Hagia Sophia is a UNESCO World Heritage Site located in Istanbul. Originally built as a cathedral in the 6th century, it later became a mosque and is now a museum. With its impressive architecture and historical importance, it is a popular tourist attraction.",
        "image": "https://example.com/hagiasophia.jpg",
        "rating": 9.8
      },
      {
        "name": "Ani Archaeological Site",
        "description": "Ani Archaeological Site is an ancient city located in the Kars province, near the Turkish-Armenian border. It was once the capital of the Bagratid Armenian Kingdom and is now in ruins. Known for its medieval churches and citadel, it is a site of great historical significance.",
        "image": "https://example.com/ani.jpg",
        "rating": 9.2
      },
      {
        "name": "Topkapi Palace",
        "description": "Topkapi Palace is a historic palace located in Istanbul. It served as the residence and administrative headquarters of the Ottoman sultans for several centuries. The palace complex includes courtyards, gardens, and numerous chambers and pavilions, showcasing Ottoman architecture and art.",
        "image": "https://example.com/topkapi.jpg",
        "rating": 9.5
      }
    ]
  }
  